app/controllers/xfiles_controller.rb

SELECT  "xfiles".* FROM "xfiles" WHERE "xfiles"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    id = params[:id] # retrieve movie ID from URI route
    @xfile = Xfile.find(id) # look up movie by unique ID

SELECT "xfiles".* FROM "xfiles"
---
  def index
    @xfiles = Xfile.all

INSERT INTO "xfiles" ("name", "content") VALUES (?, ?)
---
  def create
    @content = params[:content]
    if @content.nil?
      flash[:notice] = "Please attach a valid file"
      redirect_to new_xfile_path
    else
      params[:content].each do |file|
        @xfile = file.read
        @name = file.original_filename
        @extension = @name.split('.').last
        if @extension == "json"
          @data = Crack::JSON.parse(@xfile)
          @xfile = Xfile.create!(xfile_params) do |xfile|

SELECT "xfiles".* FROM "xfiles" WHERE (content like '%"installed"%')
---
  def shared_files
    prop = params[:prop]
    @xfiles = Xfile.where("content like ?", "%\"#{prop}\"%")

SELECT  "xfiles".* FROM "xfiles" WHERE "xfiles"."id" = ? LIMIT 1  [["id", 1]]
---
  def shared_props
    xfile_ids = params[:xfile_id]
    if xfile_ids.nil?
      redirect_to xfiles_path
    else
      prop_sets = []
      xfile_ids.each do |id|
        current_xfile = Xfile.find(id.to_i)

SELECT  "xfiles".* FROM "xfiles" WHERE "xfiles"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "xfiles" WHERE "xfiles"."id" = ?  [["id", 2]]
---
  def destroy
    @xfile = Xfile.find(params[:id])
    @xfile.destroy